; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v13 ?v5)
             (pred_3 ?v1 ?v8)
             (pred_10 ?v13 ?v8)
             (pred_6 ?v11 ?v13 )
	     (pred_8 ?v13)
             (pred_2 ?v12)
             (pred_9 ?v1)
             (pred_5 ?v8)
             (pred_7 ?v13)
             (pred_11 ?v1)
             (pred_4 ?v13)
             (pred_12 ))



(:action op_3
:parameters (?v6 ?v9 ?v10 ?v4)
:precondition (and (pred_2 ?v6) (pred_2 ?v9) (pred_9 ?v10) (pred_5 ?v4)
          (pred_1 ?v6 ?v9) (pred_3 ?v10 ?v4)
                   (pred_10 ?v9 ?v4) (pred_8 ?v6) 
                   (pred_7 ?v9) (pred_11 ?v10))
:effect (and  (pred_4 ?v9) (not (pred_7 ?v9))))


(:action op_2
:parameters (?v6 ?v2)
:precondition (and (pred_2 ?v6) (pred_2 ?v2)
               (pred_8 ?v6) (pred_1 ?v6 ?v2) (pred_4 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v6))))

(:action op_5
:parameters (?v6 ?v10)
:precondition (and (pred_2 ?v6) (pred_9 ?v10) 
                  (pred_8 ?v6) (pred_6 ?v10 ?v6) (pred_12 ))
:effect (and (pred_11 ?v10)
   (not (pred_6 ?v10 ?v6)) (not (pred_12 ))))


(:action op_1
:parameters (?v6 ?v7 ?v3)
:precondition (and (pred_2 ?v6) (pred_9 ?v7) (pred_9 ?v3)
                  (pred_8 ?v6) (pred_11 ?v3) (pred_6 ?v7 ?v6))
:effect (and (pred_11 ?v7) (pred_6 ?v3 ?v6)
        (not (pred_11 ?v3)) (not (pred_6 ?v7 ?v6))))

(:action op_4
:parameters (?v6 ?v10)
:precondition (and (pred_2 ?v6) (pred_9 ?v10) 
                  (pred_8 ?v6) (pred_11 ?v10))
:effect (and (pred_12 ) (pred_6 ?v10 ?v6) (not (pred_11 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_12 obj_23 obj_20 obj_10 obj_13 obj_22 obj_07 obj_11 obj_25 obj_19 obj_08 obj_18 obj_14 obj_30 obj_28 obj_15 obj_01 obj_31 obj_02 obj_09 obj_26 obj_04 obj_16 obj_03
    obj_29 obj_27 obj_05
    obj_06 obj_24 obj_21
    )

    (:init
       (pred_12)

       (pred_2 obj_17)
       (pred_2 obj_12)
       (pred_2 obj_23)
       (pred_2 obj_20)
       (pred_2 obj_10)
       (pred_2 obj_13)
       (pred_2 obj_22)
       (pred_2 obj_07)
       (pred_2 obj_11)
       (pred_2 obj_25)
       (pred_2 obj_19)
       (pred_2 obj_08)
       (pred_2 obj_18)
       (pred_2 obj_14)
       (pred_2 obj_30)
       (pred_2 obj_28)
       (pred_2 obj_15)
       (pred_2 obj_01)
       (pred_2 obj_31)
       (pred_2 obj_02)
       (pred_2 obj_09)
       (pred_2 obj_26)
       (pred_2 obj_04)
       (pred_2 obj_16)
       (pred_2 obj_03)
       (pred_5 obj_29)
       (pred_5 obj_27)
       (pred_5 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_24)
       (pred_9 obj_21)

       (pred_1 obj_17 obj_13)
       (pred_1 obj_17 obj_12)
       (pred_1 obj_12 obj_22)
       (pred_1 obj_12 obj_23)
       (pred_1 obj_12 obj_17)
       (pred_1 obj_23 obj_07)
       (pred_1 obj_23 obj_20)
       (pred_1 obj_23 obj_12)
       (pred_1 obj_20 obj_11)
       (pred_1 obj_20 obj_10)
       (pred_1 obj_20 obj_23)
       (pred_1 obj_10 obj_25)
       (pred_1 obj_10 obj_20)
       (pred_1 obj_13 obj_19)
       (pred_1 obj_13 obj_22)
       (pred_1 obj_13 obj_17)
       (pred_1 obj_22 obj_08)
       (pred_1 obj_22 obj_07)
       (pred_1 obj_22 obj_12)
       (pred_1 obj_22 obj_13)
       (pred_1 obj_07 obj_18)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_07 obj_23)
       (pred_1 obj_07 obj_22)
       (pred_1 obj_11 obj_14)
       (pred_1 obj_11 obj_25)
       (pred_1 obj_11 obj_20)
       (pred_1 obj_11 obj_07)
       (pred_1 obj_25 obj_30)
       (pred_1 obj_25 obj_10)
       (pred_1 obj_25 obj_11)
       (pred_1 obj_19 obj_28)
       (pred_1 obj_19 obj_08)
       (pred_1 obj_19 obj_13)
       (pred_1 obj_08 obj_15)
       (pred_1 obj_08 obj_18)
       (pred_1 obj_08 obj_22)
       (pred_1 obj_08 obj_19)
       (pred_1 obj_18 obj_01)
       (pred_1 obj_18 obj_14)
       (pred_1 obj_18 obj_07)
       (pred_1 obj_18 obj_08)
       (pred_1 obj_14 obj_31)
       (pred_1 obj_14 obj_30)
       (pred_1 obj_14 obj_11)
       (pred_1 obj_14 obj_18)
       (pred_1 obj_30 obj_02)
       (pred_1 obj_30 obj_25)
       (pred_1 obj_30 obj_14)
       (pred_1 obj_28 obj_09)
       (pred_1 obj_28 obj_15)
       (pred_1 obj_28 obj_19)
       (pred_1 obj_15 obj_26)
       (pred_1 obj_15 obj_01)
       (pred_1 obj_15 obj_08)
       (pred_1 obj_15 obj_28)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_31)
       (pred_1 obj_01 obj_18)
       (pred_1 obj_01 obj_15)
       (pred_1 obj_31 obj_16)
       (pred_1 obj_31 obj_02)
       (pred_1 obj_31 obj_14)
       (pred_1 obj_31 obj_01)
       (pred_1 obj_02 obj_03)
       (pred_1 obj_02 obj_30)
       (pred_1 obj_02 obj_31)
       (pred_1 obj_09 obj_26)
       (pred_1 obj_09 obj_28)
       (pred_1 obj_26 obj_04)
       (pred_1 obj_26 obj_15)
       (pred_1 obj_26 obj_09)
       (pred_1 obj_04 obj_16)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_04 obj_26)
       (pred_1 obj_16 obj_03)
       (pred_1 obj_16 obj_31)
       (pred_1 obj_16 obj_04)
       (pred_1 obj_03 obj_02)
       (pred_1 obj_03 obj_16)
       (pred_7 obj_30)
       (pred_7 obj_07)
       (pred_7 obj_13)
       (pred_10  obj_30 obj_29)
       (pred_10  obj_07 obj_27)
       (pred_10  obj_13 obj_05)
       (pred_4 obj_17)
       (pred_4 obj_12)
       (pred_4 obj_23)
       (pred_4 obj_20)
       (pred_4 obj_10)
       (pred_4 obj_22)
       (pred_4 obj_11)
       (pred_4 obj_25)
       (pred_4 obj_19)
       (pred_4 obj_08)
       (pred_4 obj_18)
       (pred_4 obj_14)
       (pred_4 obj_28)
       (pred_4 obj_15)
       (pred_4 obj_01)
       (pred_4 obj_31)
       (pred_4 obj_02)
       (pred_4 obj_09)
       (pred_4 obj_26)
       (pred_4 obj_04)
       (pred_4 obj_16)
       (pred_4 obj_03)

       (pred_3  obj_06 obj_29)
       (pred_3  obj_24 obj_27)
       (pred_3  obj_21 obj_05)
       (pred_6 obj_06 obj_25)
       (pred_6 obj_24 obj_14)
       (pred_6 obj_21 obj_03)
       (pred_8 obj_25)
    )

    (:goal (and
       (pred_6 obj_06 obj_14)
    ))
(:constraints
  (always (not (pred_8 obj_11)))
)
)

; plan
1. (op_5 obj_25 obj_06)
   deleted: (pred_6 obj_06 obj_25) (pred_12)
   added: (pred_11 obj_06)
   goals met: 0 of 1
2. (op_3 obj_25 obj_30 obj_06 obj_29)
   deleted: (pred_7 obj_30)
   added: (pred_4 obj_30)
   goals met: 0 of 1
3. (op_2 obj_25 obj_30)
   deleted: (pred_8 obj_25)
   added: (pred_8 obj_30)
   goals met: 0 of 1
4. (op_2 obj_30 obj_14)
   deleted: (pred_8 obj_30)
   added: (pred_8 obj_14)
   goals met: 0 of 1
5. (op_1 obj_14 obj_24 obj_06)
   deleted: (pred_11 obj_06) (pred_6 obj_24 obj_14)
   added: (pred_11 obj_24) (pred_6 obj_06 obj_14)
   goals met: 1 of 1
